load/scenarios/auth-load.yml
config:
  target: 'http://localhost:8080/api'
  http:
    cookieJar: true
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
  phases:
    - duration: 10s # Duración total de la prueba
      arrivalCount: 50 # 100 VUs en total, distribuidos uniformemente en 10 s

scenarios:
  - name: login
    flow:
      - post:
          name: 'Login'
          url: '/auth/login'
          json:
            email: 'admin-husi@gmail.com'
            password: 'Password123*'