load/scenarios/auth-load.yml
config:
  target: '${BACKEND_URL}${CONVENTION_API}'
  processor: '../dist/hooks/authHook.js'
  defaults:
    headers:
      Content-Type: 'application/json'
      Cookie: '{{ cookies }}'
  phases:
    - name: 'Login Spike'
      duration: 60
      arrivalRate: 30

scenarios:
  - name: 'Login Load Test'
    flow:
      - post:
          url: '/auth/login'
          json:
            email: '${ADMIN_EMAIL}'
            password: '${ADMIN_PASSWORD}'
      - think: 2
      - get:
          url: '/auth/me'